package org.siva.mapping.service;

import java.util.ArrayList;
import java.util.List;
import java.util.Scanner;

import org.siva.mapping.dao.InstructorDao;
import org.siva.mapping.entity.Course;
import org.siva.mapping.entity.Instructor;
import org.siva.mapping.entity.InstructorDetail;
import org.siva.mapping.entity.Review;
import org.siva.mapping.entity.Student;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.stereotype.Service;

@Service
public class InstructorServiceImpl implements InstructorService {
	
	@Autowired
	private InstructorDao instructorDao;
	
	Scanner scanner = new Scanner(System.in);
	
	@Override
	public void addInstructor() {
		Instructor instructor = new Instructor();
		System.out.print("Enter Instructor Firstname: ");
		instructor.setFirstName(scanner.next());
		System.out.print("Enter Instructor Lastname: ");
		instructor.setLastName(scanner.next());
		System.out.print("Enter Email: ");
		instructor.setEmail(scanner.next());
		InstructorDetail instructorDetail = new InstructorDetail();
		System.out.print("Enter Youtube Channel: ");
		instructorDetail.setYoutubeChannel(scanner.next());
		System.out.print("Enter Hobby: ");
		instructorDetail.setHobby(scanner.next());
		instructor.setInstructorDetail(instructorDetail);
		List<Course> courses = new ArrayList<Course>();
		System.out.print("✌️✌️✌️ How many courses you want to add -->");
		int coursenum = scanner.nextInt();
		System.out.print("Enter Course Title: ");
		for (int i=1; i<=coursenum; i++) {
			Course course = new Course();
			course.setCourseTitle(scanner.next());
			course.setInstructor(instructor);
			System.out.print("Enter Review Count: ");
			int reviewCount = scanner.nextInt();
			List<Review> reviews = new ArrayList<Review>();
			System.out.print("Enter Course Review: ");
			for (int j=1; j<=reviewCount; j++) {
				Review review = new Review();
				review.setComment(scanner.next());
				reviews.add(review);
				if (j==reviewCount) {
					break;
				}
				System.out.print("Enter One More Course Review: ");
			}
			course.setReviews(reviews);
			courses.add(course);
			if (i==coursenum) {
				break;
			}
			System.out.print("Add One More Course Title: ");
		}
		instructor.setCourses(courses);
		boolean isSaved = instructorDao.insertInstructor(instructor);
		if (isSaved) {
			System.out.println("❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️");
			System.out.println("                                                                     CONGRATS, INSTRUCTOR SUCCESSFULLY ADDED TO OUR TUITION            ");
			System.out.println("❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️");
		}
		else {
			System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
			System.err.println("                                                                     SOMETHING WENT WRONG PLEASE CHECK YOUR DETAILS ONCE AGAIN               ");
			System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
		}
	}
	
	@Override
	public void displayInstructorByInstructorId() {
		System.out.print("Enter Instructor Id: ");
		int instructorId = scanner.nextInt();
		Instructor instructor = instructorDao.selectInstructorByInstructorId(instructorId);
		if (instructor!=null) {
			System.out.println("Instructor Id: "+instructor.getId());
			System.out.println("Instructor Name: "+instructor.getFirstName()+" "+instructor.getLastName());
			System.out.println("Instructor Email: "+instructor.getEmail());
			System.out.println("Instructor Youtube Channel: "+instructor.getInstructorDetail().getYoutubeChannel());
			System.out.println("Instructor Hobby: "+instructor.getInstructorDetail().getHobby());
			System.out.print("Instructor Courses: ");
			List<Course> courses = instructor.getCourses();
			if (courses.isEmpty()) {
				System.out.print("Instructor does not have any courses");
			}
			else {
				for (int i=0; i<courses.size(); i++) {
					if (i==courses.size()-1) {
						System.out.print(courses.get(i).getCourseTitle());
						break;
					}
					System.out.print(courses.get(i).getCourseTitle()+", ");
				}
			}
			System.out.println();
		}
		else {
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
			System.err.println("                                                                         INSTRUCTOR NOT FOUND                                                                 ");
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
		}
	}
	
	@Override
	public void displayCoursesByInstructorId() {
		System.out.print("Enter Instructor Id: ");
		int instructorId = scanner.nextInt();
		List<Course> courses = instructorDao.selectCoursesByInstructorId(instructorId);
		if (courses!=null) {
			if (!courses.isEmpty()) {
				for (Course course : courses) {
					System.out.println("Course id: "+course.getId());
					System.out.println("Course Title: "+course.getCourseTitle());
					System.out.println("🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞🛞");
				}
			}
			else {
				System.err.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
				System.err.println("                                                                     NOW THERE IS NO AVAILABLE COURSES PRESENT IN THE PARTICULAR INSTRUCTOR                                                                                       ");
				System.err.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
			}
		}
		else {
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
			System.err.println("                                                                         INSTRUCTOR NOT FOUND                                                                 ");
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
		}
	}
	
	@Override
	public void displayCoursesAlongWithInstrucorNameByInstructorId() {
		System.out.print("Enter Instructor Id: ");
		int instructorId = scanner.nextInt();
		Instructor instructor = instructorDao.selectCoursesAlongWithInstructorId(instructorId);
		if (instructor!=null) {
			System.err.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
			System.err.println("👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉👉  Instructor Name:  "+instructor.getFirstName()+" "+instructor.getLastName()+"  👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈👈");
			System.err.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
			List<Course> courses = instructor.getCourses();
			System.out.println("Instructor Has "+courses.size()+" Courses Those Are");
			int count = 1;
			for (Course course : courses) {
				System.out.println(count+"."+course.getCourseTitle());
				count++;
			}
		}
		else {
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
			System.err.println("                                                                         INSTRUCTOR NOT FOUND                                                                 ");
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
		}
	}
	
	@Override
	public void displayAllInstructorsInformation() {
		List<Instructor> instructors = instructorDao.selectAllInstructors();
		if (instructors!=null) {
			if (!instructors.isEmpty()) {
				for (Instructor instructor : instructors) {
					System.out.println("Instructor Id: "+instructor.getId());
					System.out.println("Instructor Name: "+instructor.getFirstName()+" "+instructor.getLastName());
					System.out.println("Instructor Email: "+instructor.getEmail());
					System.out.println("Instructor Youtube Channel: "+instructor.getInstructorDetail().getYoutubeChannel());
					System.out.println("Instructor Hobby: "+instructor.getInstructorDetail().getHobby());
					System.out.print("Instructor Courses: ");
					List<Course> courses = instructor.getCourses();
					if (courses.isEmpty()) {
						System.out.print("Instructor does not have any courses");
					}
					else {
						for (int i=0; i<courses.size(); i++) {
							if (i==courses.size()-1) {
								System.out.print(courses.get(i).getCourseTitle());
								break;
							}
							System.out.print(courses.get(i).getCourseTitle()+", ");
						}
					}
					System.out.println();
					System.out.println("🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓");
				}
			}
			else {
				System.err.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
				System.err.println("                                                                     NOW THERE IS NO INSTRUCTOR PRESENT IN THE TUITION                                                                                            ");
				System.err.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
			}
		}
		else {
			System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
			System.err.println("                                                                     SOMETHING WENT WRONG PLEASE CHECK YOUR DETAILS ONCE AGAIN               ");
			System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
		}
	}
	
	@Override
	public void displayInstructorInformationByYoutubeChannel() {
		System.out.print("Enter Instructor Youtube Channel: ");
		String youtubeChannel = scanner.next();
		Instructor instructor = instructorDao.selectInstructorInformationByYoutubeChannel(youtubeChannel);
		if (instructor!=null) {
			System.out.println("Instructor Id: "+instructor.getId());
			System.out.println("Instructor Name: "+instructor.getFirstName()+" "+instructor.getLastName());
			System.out.println("Instructor Email: "+instructor.getEmail());
			System.out.println("Instructor Youtube Channel: "+instructor.getInstructorDetail().getYoutubeChannel());
			System.out.println("Instructor Hobby: "+instructor.getInstructorDetail().getHobby());
			System.out.print("Instructor Courses: ");
			List<Course> courses = instructor.getCourses();
			if (courses.isEmpty()) {
				System.out.print("Instructor does not have any courses");
			}
			else {
				for (int i=0; i<courses.size(); i++) {
					if (i==courses.size()-1) {
						System.out.print(courses.get(i).getCourseTitle());
						break;
					}
					System.out.print(courses.get(i).getCourseTitle()+", ");
				}
			}
			System.out.println();
		}
		else {
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
			System.err.println("                                                                         INSTRUCTOR NOT FOUND                                                                 ");
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
		}
	}
	
	@Override
	public void changeeInstructorEmailByInstructorId() {
		System.out.print("Enter Instructor Id: ");
		int instructorId = scanner.nextInt();
		System.out.print("Enter Updated Instructor Email: ");
		String email = scanner.next();
		boolean isUpdated = instructorDao.updateInstructorEmailByInstructorId(instructorId, email);
		if (isUpdated) {
			System.out.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
			System.out.println("                                                                  INSTRUCTOR EMAIL UPDATED SUCCESSFULLY                                                  ");
			System.out.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
		}
		else {
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
			System.err.println("                                                                         INSTRUCTOR NOT FOUND                                                                 ");
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
		}
	}
	
	@Override
	public void addCoursesForInstructorByInstructorId() {
		System.out.print("Enter Instructor Id: ");
		int instructorId = scanner.nextInt();
		Instructor instructor = instructorDao.selectInstructorByInstructorId(instructorId);
		if (instructor!=null) {
			System.out.print("How Many Courses Do You Want To Add: ");
			int coursesList = scanner.nextInt();
			System.out.print("Add Course Title: ");
			List<Course> courses = instructor.getCourses();
			for (int i=1; i<=coursesList; i++) {
				Course course = new Course();
				course.setCourseTitle(scanner.next());
				course.setInstructor(course.getInstructor());
				courses.add(course);
				if (i==coursesList) {
					break;
				}
				System.out.print("Add One More Title: ");
			}
			System.out.println();
			boolean isAdded = instructorDao.insertCoursesForInstructorByInstructorId(instructorId, courses);
			if (isAdded) {
				System.out.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
				System.out.println("                                                                  INSTRUCTOR COURSES ADDED SUCCESSFULLY                                                  ");
				System.out.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
			}
			else {
				System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
				System.err.println("                                                                     SOMETHING WENT WRONG PLEASE CHECK YOUR DETAILS ONCE AGAIN               ");
				System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
			}
		}
		else {
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
			System.err.println("                                                                         INSTRUCTOR NOT FOUND                                                                 ");
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
		}
	}
	
	@Override
	public void changeCourseTitleByCourseId() {
		System.out.print("Enter Course ID: ");
		int courseId = scanner.nextInt();
		System.out.print("Enter New Course Title: ");
		String courseTitle = scanner.next();
		boolean isUpdated = instructorDao.updateCourseTitleByCourseId(courseId, courseTitle);
		if (isUpdated) {
			System.out.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
			System.out.println("                                                                  COURSE TITLE UPDATED SUCCESSFULLY                                                  ");
			System.out.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
		}
		else {
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
			System.err.println("                                                                         COURSE NOT FOUND                                                                 ");
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
		}
	}
	
	@Override
	public void removeInstructorByInstructorId() {
		System.out.print("Enter Instructor Id: ");
		int instructorId = scanner.nextInt();
		boolean isDelete = instructorDao.deleteCourseInstructorByInstructorId(instructorId);
		if (isDelete) {
			System.out.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
			System.out.println("                                                                     INSTRUCTOR REMOVED SUCCESSFULLY                     ");
			System.out.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
		}
		else {
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
			System.err.println("                                                                         INSTRUCTOR NOT FOUND                                                                 ");
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
		}
	}
	
	@Override
	public void removeCourseByCourseId() {
		System.out.print("Enter Course ID: ");
		int courseId = scanner.nextInt();
		boolean isDelete = instructorDao.removeCourseByCourseId(courseId);
		if (isDelete) {
			System.out.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
			System.out.println("                                                                     COURSE REMOVED SUCCESSFULLY                     ");
			System.out.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
		}
		else {
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
			System.err.println("                                                                          COURSE NOT FOUND                                                                 ");
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
		}
	}
	
	@Override
	public void addCourseWithReviews() {
		Course course = new Course();
		System.out.print("Enter Course Title: ");
		course.setCourseTitle(scanner.next());
		System.out.print("How Many Reviews You Want: ");
		int reviewCount = scanner.nextInt();
		System.out.print("Enter Course Review: ");
		List<Review> reviews = new ArrayList<Review>();
		for (int i=1; i<=reviewCount; i++) {
			Review review = new Review();
			review.setComment(scanner.next());
			reviews.add(review);
			if (i==reviewCount) {
				break;
			}
			System.out.print("Add One More Course Review: ");
		}
		course.setReviews(reviews);
		boolean isAdded = instructorDao.insertCourseWithReviews(course);
		if (isAdded) {
			System.out.println("❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️");
			System.out.println("                                                                       COURSE WITH REVIEWS ADDED SUCCESSFULLY            ");
			System.out.println("❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️");
		}
		else {
			System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
			System.err.println("                                                                     SOMETHING WENT WRONG PLEASE CHECK YOUR DETAILS ONCE AGAIN               ");
			System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
		}
	}
	
	@Override
	public void displayCourseAndReviewById() {
		System.out.print("Enter Course ID: ");
		int courseId = scanner.nextInt();
		Course course = instructorDao.selectCourseAndReviewsByCourseId(courseId);
		if (course!=null) {
			System.out.println("Course Id: "+course.getId());
			System.out.println("Course Title: "+course.getCourseTitle());
			System.out.println("Instructor Name: "+course.getInstructor().getFirstName()+" "+course.getInstructor().getLastName());
			List<Review> reviews = course.getReviews();
			System.out.print("Course Reviews: ");
			if (reviews.isEmpty()) {
				System.out.print("Does not have any reviews");
			}
			else {
				for (int i=0; i<reviews.size(); i++) {
					if (i==reviews.size()-1) {
						System.out.print(reviews.get(i).getComment());
						break;
					}
					System.out.print(reviews.get(i).getComment()+", ");
				}
			}
			System.out.println();
		}
		else {
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
			System.err.println("                                                                          COURSE NOT FOUND                                                                 ");
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
		}
	}
	
	@Override
	public void dispalyAllCoursesAndReviews() {
		List<Course> courses = instructorDao.selectAllCourses();
		if (courses!=null) {
			if (!courses.isEmpty()) {
				for (Course course : courses) {
					System.out.println("Course Id: "+course.getId());
					System.out.println("Course Title: "+course.getCourseTitle());
					System.out.println("Instructor Name: "+course.getInstructor().getFirstName()+" "+course.getInstructor().getLastName());
					List<Review> reviews = course.getReviews();
					System.out.print("Course Reviews: ");
					if (reviews.isEmpty()) {
						System.out.print("Does not have any reviews");
					}
					else {
						for (int i=0; i<reviews.size(); i++) {
							if (i==reviews.size()-1) {
								System.out.print(reviews.get(i).getComment());
								break;
							}
							System.out.print(reviews.get(i).getComment()+", ");
						}
					}
					System.out.println();
					System.out.println("😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺😺");
				}
			}
			else {
				System.err.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
				System.err.println("                                                                  NOW THERE IS NO COURSE PRESENT IN THE TUITION                                                                                            ");
				System.err.println("✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️✌️");
			}
		}
		else {
			System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
			System.err.println("                                                                     SOMETHING WENT WRONG PLEASE CHECK YOUR DETAILS ONCE AGAIN               ");
			System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
		}
	}
	
	@Override
	public void addCourseWithStudent() {
		Course course = new Course();
		System.out.print("Enter Course Title: ");
		course.setCourseTitle(scanner.next());
		System.out.print("How Many Students Do You Want To Add: ");
		int studentsCount = scanner.nextInt();
		List<Student> students = new ArrayList<Student>();
		for (int i=1; i<=studentsCount; i++) {
			Student student = new Student();
			System.out.print("Enter First Name: ");
			student.setFirstName(scanner.next());
			System.out.print("Enter Last Name: ");
			student.setLastName(scanner.next());
			System.out.print("Enter Email: ");
			student.setEmail(scanner.next());
			students.add(student);
			if (i==studentsCount) {
				break;
			}
		}
		course.setStudents(students);
		boolean isSaved = instructorDao.addCoursesWithStudent(course);
		if (isSaved) {
			System.out.println("❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️");
			System.out.println("                                                                     CONGRATS, STUDENT SUCCESSFULLY ADDED TO OUR TUITION            ");
			System.out.println("❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️");
		}
		else {
			System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
			System.err.println("                                                                     SOMETHING WENT WRONG PLEASE CHECK YOUR DETAILS ONCE AGAIN               ");
			System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
		}
	}
	
	@Override
	public void displayCourseAndStudentByCourseId() {
		System.out.print("Enter Course ID: ");
		int courseId = scanner.nextInt();
		Course course = instructorDao.displayStudentAndCourseByCourseId(courseId);
		if (course!=null) {
			System.out.println("Course Id: "+course.getId());
			System.out.println("Course Title: "+course.getCourseTitle());
			System.out.print("Course Review: ");
			List<Review> reviews = course.getReviews();
			if (reviews.isEmpty()) {
				System.out.print("Doest Not Have Any Reviews");
				System.out.println();
			}
			else {
				for (int i=0; i<reviews.size(); i++) {
					if (i==reviews.size()-1) {
						System.out.print(reviews.get(i).getComment());
						break;
					}
					System.out.print(reviews.get(i).getComment()+", ");
				}
				System.out.println();
			}
			System.out.println("🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸");
			System.out.println("               REGISTERED COURSE STUDENTS            ");
			System.out.println("🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸");
			
			List<Student> students = course.getStudents();
			if (students.isEmpty()) {
				System.out.println("Does not have any registered students");
			}
			else {
				for (Student student : students) {
					System.out.println("Student Name: "+student.getFirstName()+" "+student.getLastName());
					System.out.println("Student Email: "+student.getEmail());
					System.out.println("🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓🧑‍🎓");
				}
			}
		}
		else {
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
			System.err.println("                                                                          COURSE NOT FOUND                                                                 ");
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
		}
	}
	
	@Override
	public void displayStudentAndCourseByStudentId() {
		System.out.print("Enter Student Id: ");
		int studentId = scanner.nextInt();
		Student student = instructorDao.selectStudentByStudentId(studentId);
		if (student!=null) {
			System.out.println("Student Name: "+student.getFirstName()+" "+student.getLastName());
			System.out.println("Student Email: "+student.getEmail());
			List<Course> courses = student.getCourses();
			System.out.print("Student Courses: ");
			if (courses.isEmpty()) {
				System.out.print("No Course Avaliable");
				System.out.println();
			}
			else {
				for (int i=0; i<courses.size(); i++) {
					if (i==courses.size()-1) {
						System.out.print(courses.get(i).getCourseTitle());
						break;
					}
					System.out.print(courses.get(i).getCourseTitle()+", ");
				}
				System.out.println();
			}
		}
		else {
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
			System.err.println("                                                                          STUDENT NOT FOUND                                                                 ");
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
		}
	}
	
	@Override
	public void addMoreCouresByStudentId() {
		System.out.print("Enter Student Id: ");
		int studentId = scanner.nextInt();
		Student student = instructorDao.selectStudentByStudentId(studentId);
		if (student!=null) {
			List<Course> courses = student.getCourses();
			System.out.print("How Many Coures You Want To Add: ");
			int couresCount = scanner.nextInt();
			for (int i=1; i<=couresCount; i++) {
				Course course = new Course();
				System.out.print("Enter Course Title: ");
				course.setCourseTitle(scanner.next());
				courses.add(course);
			}
			student.setCourses(courses);
			boolean isAdded = instructorDao.insertCoursesByStudentById(student);
			if (isAdded) {
				System.out.println("❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️");
				System.out.println("                                                                                STUDENT COURSE ADDED SUCCESSFULLY            ");
				System.out.println("❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️");
			}
			else {
				System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
				System.err.println("                                                                     SOMETHING WENT WRONG PLEASE CHECK YOUR DETAILS ONCE AGAIN               ");
				System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
			}
		}
		else {
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
			System.err.println("                                                                          STUDENT NOT FOUND                                                                 ");
			System.err.println("👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊");
		}
	}
	
	@Override
	public void removeCourseAndStudentByCourseId() {
		System.out.print("Enter Course Id: ");
		int courseId = scanner.nextInt();
		boolean isDeleted = instructorDao.deleteCourseAndStudentByCourseId(courseId);
		if (isDeleted) {
			System.out.println("❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️");
			System.out.println("                                                                 COURSE AND STUDENT REMOVED SUCCESSFULLY            ");
			System.out.println("❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️");
		}
		else {
			System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
			System.err.println("                                                                          COURSE NOT FOUND               ");
			System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
		}
	}
	
	@Override
	public void removeStudentAndCourseByCourseId() {
		System.out.print("Enter Student Id: ");
		int studentId = scanner.nextInt();
		boolean isDeleted = instructorDao.deleteStudentAndCourseByStudentId(studentId);
		if (isDeleted) {
			System.out.println("❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️");
			System.out.println("                                                                 STUDENT AND COURSE REMOVED SUCCESSFULLY            ");
			System.out.println("❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️");
		}
		else {
			System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
			System.err.println("                                                                          STUDENT NOT FOUND               ");
			System.err.println("👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎");
		}
	}
}
